probonopd/Synth_Dexed/esp32/main/esp32_usb_audio.cpp
/*
 * FMRack ESP32-S3 Port – USB Audio Class (UAC 1.0) output driver
 *
 * Registers a second USB host client that detects UAC 1.0 playback
 * devices (USB DACs, headphones, sound cards).  When one is found:
 *
 *   1. AudioControl and AudioStreaming interfaces are claimed.
 *   2. SET_INTERFACE selects the streaming alternate setting.
 *   3. Double-buffered isochronous OUT transfers deliver audio continuously.
 *
 * Audio data flow:
 *
 *   audio_write_task (Core 1)
 *     └─ esp32_usb_audio_write_stereo()  [lock-free ring push]
 *                │
 *   s_ring[] (internal SRAM, ~46 ms)
 *                │
 *   usb_audio_task (Core 0)  ← drains ring via isochronous OUT transfers
 *
 * The I2S output continues running in parallel; this driver adds the USB
 * device as a second (simultaneously active) audio sink.
 *
 * Channel mixing:
 *   1 ch  → (L+R)/2  (mono downmix)
 *   2 ch  → L, R     (stereo passthrough)
 *   3-7 ch → L, R, 0, 0, …  (stereo + silent surround channels)
 *
 * Sample rate conversion:
 *   Exact match     → passthrough
 *   44100 ↔ 48000   → linear interpolation
 *   Other mismatch  → device is skipped (incompatible)
 */

#include "esp32_usb_audio.h"
#include "esp32_config.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/portmacro.h"
#include "usb/usb_host.h"
#include "esp_log.h"
#include "esp_heap_caps.h"

#include <string.h>
#include <stdint.h>
#include <stdbool.h>

static const char *TAG = "usb_audio";

/* ---------------------------------------------------------------------- */
/* USB Audio Class 1.0 constants                                           */
/* ---------------------------------------------------------------------- */
#define USB_CLASS_AUDIO                 0x01
#define USB_SUBCLASS_AUDIOCONTROL       0x01
#define USB_SUBCLASS_AUDIOSTREAMING     0x02

/* Class-specific interface descriptor sub-types (UAC 1.0 §A.5) */
#define UAC_SUBTYPE_FORMAT_TYPE         0x02
#define FORMAT_TYPE_I                   0x01

/* SET_INTERFACE setup packet fields */
#define SETUP_bmReqType_SET_INTF        0x01  /* host→device, standard, interface */
#define SETUP_bRequest_SET_INTERFACE    0x0B

/* ---------------------------------------------------------------------- */
/* Transfer geometry                                                        */
/* ---------------------------------------------------------------------- */
/* Isochronous packets per transfer — each packet = 1 USB full-speed frame
 * = 1 ms.  6 packets = 6 ms per transfer; gives the task loop ample time
 * to refill while the other buffer is in-flight. */
#define ISOC_PKTS_PER_XFER      6

/* Number of concurrent transfers (triple buffering).
 * 3 transfers × 6 ms each = 18 ms in the isochronous pipeline.
 * Double-buffering (2) left only 12 ms margin; any scheduling hiccup
 * caused a gap → audible choppiness.  Triple-buffering absorbs it. */
#define ISOC_XFER_COUNT         3

/* Maximum bytes per isochronous packet.
 * USB full-speed audio MPS is at most 1023 bytes.
 * 7 channels × 48000 Hz × 1 ms × 3 bytes = 1008 bytes — within limit. */
#define ISOC_PKT_MAX_BYTES      1023

/* Total data buffer per transfer. */
#define ISOC_XFER_BUF_BYTES     (ISOC_PKTS_PER_XFER * ISOC_PKT_MAX_BYTES)

/* Ring buffer: 4096 stereo pairs ≈ 85 ms at 48000 Hz.  Power-of-2 size
 * enables efficient lock-free SPSC (single producer / single consumer)
 * operation without cross-core spinlocks.  Kept in internal SRAM so ring
 * reads/writes never add PSRAM bus latency. */
#define RING_STEREO_PAIRS       4096
#define RING_SIZE_MASK          (RING_STEREO_PAIRS - 1)

/* ---------------------------------------------------------------------- */
/* Ring buffer (lock-free SPSC, internal SRAM)                             */
/*                                                                         */
/* Producer: audio_write_task on Core 1 (ring_push).                       */
/* Consumer: usb_audio_task / isoc callback on Core 0 (ring_pop).          */
/*                                                                         */
/* The old spinlock-based ring used portENTER_CRITICAL which disables      */
/* interrupts on BOTH cores for the duration of the per-sample copy loop.  */
/* With 256-pair pushes that's long enough to disturb USB SOF timing and   */
/* cause isochronous transfer gaps — audible as choppy playback.           */
/*                                                                         */
/* Lock-free SPSC with bulk memcpy eliminates cross-core contention        */
/* entirely and runs an order of magnitude faster.                         */
/* ---------------------------------------------------------------------- */
static DRAM_ATTR int16_t s_ring[RING_STEREO_PAIRS * 2]; /* interleaved L/R */
static volatile int s_ring_wr  = 0;  /* write head (in stereo pairs) */
static volatile int s_ring_rd  = 0;  /* read head  (in stereo pairs) */

/* Diagnostic counters (used by ring ops and heartbeat). */
static volatile uint32_t s_ring_underruns = 0;  /* pop got less than requested */
static volatile uint32_t s_ring_overflows = 0;  /* push had to drop data */

/* Push stereo pairs into ring.  Drops excess if ring is full (should not
 * happen in steady state since producer and consumer run at matched rates). */
static void ring_push(const int16_t *stereo, int pairs)
{
    int wr = s_ring_wr;
    int rd = __atomic_load_n(&s_ring_rd, __ATOMIC_ACQUIRE);
    int avail = (rd - wr - 1 + RING_STEREO_PAIRS) & RING_SIZE_MASK;
    if (pairs > avail) {
        s_ring_overflows++;
        pairs = avail;
    }
    if (pairs <= 0) return;

    /* Copy in up to two segments (handles wrap-around). */
    int first = RING_STEREO_PAIRS - wr;
    if (first > pairs) first = pairs;
    memcpy(&s_ring[wr * 2], stereo, first * 2 * sizeof(int16_t));
    int second = pairs - first;
    if (second > 0)
        memcpy(&s_ring[0], stereo + first * 2, second * 2 * sizeof(int16_t));

    __atomic_store_n(&s_ring_wr, (wr + pairs) & RING_SIZE_MASK, __ATOMIC_RELEASE);
}

/* Current fill level (approximate — no lock). */
static inline int ring_fill_level(void)
{
    int wr = __atomic_load_n(&s_ring_wr, __ATOMIC_ACQUIRE);
    int rd = __atomic_load_n(&s_ring_rd, __ATOMIC_ACQUIRE);
    return (wr - rd + RING_STEREO_PAIRS) & RING_SIZE_MASK;
}

/* Pop up to @p pairs stereo pairs from ring into @p out.
 * Returns number actually popped (may be less if ring is thin). */
static int ring_pop(int16_t *out, int pairs)
{
    int rd = s_ring_rd;
    int wr = __atomic_load_n(&s_ring_wr, __ATOMIC_ACQUIRE);
    int avail = (wr - rd + RING_STEREO_PAIRS) & RING_SIZE_MASK;
    if (pairs > avail) pairs = avail;
    if (pairs <= 0) return 0;

    /* Copy out in up to two segments (handles wrap-around). */
    int first = RING_STEREO_PAIRS - rd;
    if (first > pairs) first = pairs;
    memcpy(out, &s_ring[rd * 2], first * 2 * sizeof(int16_t));
    int second = pairs - first;
    if (second > 0)
        memcpy(out + first * 2, &s_ring[0], second * 2 * sizeof(int16_t));

    __atomic_store_n(&s_ring_rd, (rd + pairs) & RING_SIZE_MASK, __ATOMIC_RELEASE);
    return pairs;
}

/* ---------------------------------------------------------------------- */
/* Device state                                                            */
/* ---------------------------------------------------------------------- */
typedef enum {
    AUDIO_IDLE = 0,
    AUDIO_OPEN,        /* device open, descriptors parsed */
    AUDIO_SET_INTF,    /* awaiting SET_INTERFACE control response */
    AUDIO_STREAMING,   /* isochronous OUT active */
} audio_state_t;

