probonopd/Synth_Dexed/esp32/main/esp32_usb_audio.cpp
typedef struct {
    usb_device_handle_t  dev_hdl;
    uint8_t  ctrl_intf;          /* AudioControl interface number */
    uint8_t  stream_intf;        /* AudioStreaming interface number */
    uint8_t  stream_alt;         /* Alternate setting that enables streaming */
    uint8_t  ep_out;             /* Isochronous OUT endpoint address */
    uint16_t ep_out_mps;         /* Max packet size */
    uint8_t  channels;           /* Output channel count (1-7) */
    uint8_t  bytes_per_sample;   /* 2 = 16-bit, 3 = 24-bit */
    uint32_t dev_sample_rate;    /* Device native sample rate (Hz) */

    /* Per-packet fractional sample tracking (avoids drift at 44100 Hz).
     * samples_per_ms = dev_sample_rate / 1000; fractional part × 1000 stored.
     * Each ms: frac_acc += frac_inc; if >= 1000, emit +1 sample and subtract 1000. */
    uint32_t base_samp_per_ms;   /* floor(dev_sample_rate / 1000) */
    uint32_t frac_inc;           /* frac_acc increment per ms */
    uint32_t frac_acc;           /* Current accumulator */

    /* SRC: fixed-point step for reading the ring when rates differ.
     * input_step_fp = (FMRACK_SAMPLE_RATE << 16) / dev_sample_rate
     * src_pos_fp advances through ring samples. */
    bool     need_src;
    uint32_t src_step_fp;        /* 16.16 fixed-point step */
    uint32_t src_pos_fp;         /* 16.16 position within current pop batch */

    usb_transfer_t *isoc_xfers[ISOC_XFER_COUNT];
    usb_transfer_t *ctrl_xfer;
    int      xfer_pending;       /* number of in-flight isoc transfers */
    audio_state_t state;
    bool     ctrl_intf_claimed;
    bool     stream_intf_claimed;
} usb_audio_dev_t;

static usb_audio_dev_t s_dev = {};
static usb_host_client_handle_t s_client = NULL;
static volatile bool s_running = false;
static TaskHandle_t  s_task    = NULL;
static volatile uint32_t s_isoc_ok_count = 0; /* successful isoc OUT completions */
static volatile uint32_t s_isoc_err_count_total = 0;
static volatile uint32_t s_resubmit_fails = 0;

/* Action flags set from client event callback */
#define ACTION_OPEN   (1u << 0)
#define ACTION_CLOSE  (1u << 1)
static volatile uint32_t s_actions   = 0;
static volatile uint8_t  s_new_addr  = 0;

/* SET_INTERFACE result (set in control transfer callback) */
static volatile bool s_set_intf_done = false;
static volatile bool s_set_intf_ok   = false;

/* ---------------------------------------------------------------------- */
/* SRC helpers                                                             */
/* ---------------------------------------------------------------------- */

/* Compute SRC step for reading from the ring (source = FMRACK_SAMPLE_RATE)
 * when the device runs at dev_rate.
 *
 *   src_pos advances: for each output device sample, step forward by
 *   FMRACK_SAMPLE_RATE / dev_rate source samples.
 *   If src_pos < num_source_samples − 1 → interpolate;
 *   else repeat last sample.
 */
static void src_init(usb_audio_dev_t *dev)
{
    dev->need_src   = false;
    dev->src_step_fp = 0;
    dev->src_pos_fp  = 0;

    uint32_t src_rate = (uint32_t)FMRACK_SAMPLE_RATE;
    uint32_t dst_rate = dev->dev_sample_rate;
    if (src_rate == dst_rate) return;

    /* Only support 44100 ↔ 48000 conversions. */
    bool ok = (src_rate == 44100 && dst_rate == 48000) ||
              (src_rate == 48000 && dst_rate == 44100);
    if (!ok) return;   /* caller will have already rejected device */

    dev->need_src    = true;
    /* step_fp = (src_rate << 16) / dst_rate */
    dev->src_step_fp = ((uint64_t)src_rate << 16) / dst_rate;
}

/* Read @p dst_pairs output stereo pairs from the ring with SRC applied.
 * Silences output if ring is dry.
 *
 * Key: only CONSUME the source samples actually used; the +1 boundary
 * sample needed for linear interpolation is PEEKed but left in the ring so
 * it becomes the first sample of the next call.  The old code popped all
 * "need" samples including the boundary, wasting ~2 samples per call and
 * draining the ring ~4 % faster than it was filled — audible as choppy
 * playback on any device whose sample rate differs from FMRACK_SAMPLE_RATE. */
static void src_pop_stereo(usb_audio_dev_t *dev, int16_t *dst, int dst_pairs)
{
    /* Compute exactly how many source samples are consumed by this batch. */
    uint32_t end_pos = dev->src_pos_fp + (uint32_t)dev->src_step_fp * dst_pairs;
    int consumed = (int)(end_pos >> 16);
    int need = consumed + 1;  /* +1 for interpolation boundary (peeked, not consumed) */

    static DRAM_ATTR int16_t src_tmp[512 * 2]; /* 512 stereo pairs */
    if (need > 512) { need = 512; consumed = need - 1; }

    /* Peek 'need' samples from ring WITHOUT advancing the read pointer. */
    int rd = s_ring_rd;
    int wr = __atomic_load_n(&s_ring_wr, __ATOMIC_ACQUIRE);
    int avail = (wr - rd + RING_STEREO_PAIRS) & RING_SIZE_MASK;
    int got = (need <= avail) ? need : avail;

    if (got < need)
        s_ring_underruns++;

    /* Copy from ring in up to two segments (handles wrap-around). */
    {
        int first = RING_STEREO_PAIRS - rd;
        if (first > got) first = got;
        memcpy(src_tmp, &s_ring[rd * 2], first * 2 * sizeof(int16_t));
        int second = got - first;
        if (second > 0)
            memcpy(src_tmp + first * 2, &s_ring[0], second * 2 * sizeof(int16_t));
    }

    /* Pad with silence if ring ran dry. */
    for (int i = got * 2; i < need * 2; i++) src_tmp[i] = 0;

    /* Advance ring read pointer by consumed only (boundary sample stays). */
    int actual_consume = (consumed <= avail) ? consumed : avail;
    __atomic_store_n(&s_ring_rd, (rd + actual_consume) & RING_SIZE_MASK, __ATOMIC_RELEASE);

    /* Linear interpolation. */
    uint32_t pos = dev->src_pos_fp;
    for (int i = 0; i < dst_pairs; i++) {
        int   i0   = pos >> 16;
        int   i1   = i0 + 1;
        if (i1 >= need) i1 = need - 1;
        uint32_t frac = pos & 0xFFFF;
        int32_t  f    = (int32_t)frac;
        int32_t  inv  = 65536 - f;
        dst[i * 2]     = (int16_t)((src_tmp[i0*2]   * inv + src_tmp[i1*2]   * f) >> 16);
        dst[i * 2 + 1] = (int16_t)((src_tmp[i0*2+1] * inv + src_tmp[i1*2+1] * f) >> 16);
        pos += dev->src_step_fp;
    }
    /* Keep fractional remainder for next call. */
    dev->src_pos_fp = pos & 0xFFFF;
}

/* ---------------------------------------------------------------------- */
/* Isochronous packet pack                                                  */
/* ---------------------------------------------------------------------- */

/* Pack @p frames stereo pairs → @p buf with channel mapping.
 * Reads from ring or via SRC depending on dev->need_src.
 * Returns bytes written. */
static int pack_frames(usb_audio_dev_t *dev, uint8_t *buf, int frames)
{
    /* Temp stereo buffer — at most ISOC_PKTS_PER_XFER × 49 frames each ms. */
    static DRAM_ATTR int16_t stereo_tmp[64 * 2]; /* 64 stereo pairs = 128 int16 */
    if (frames > 64) frames = 64;

    if (dev->need_src) {
        src_pop_stereo(dev, stereo_tmp, frames);
    } else {
        int got = ring_pop(stereo_tmp, frames);
        if (got < frames) {
            s_ring_underruns++;
            /* Fill silence for missing samples. */
            for (int i = got * 2; i < frames * 2; i++) stereo_tmp[i] = 0;
        }
    }

    int ch  = dev->channels;
    int bps = dev->bytes_per_sample;  /* 2 = 16-bit, 3 = 24-bit */
    uint8_t *p = buf;
    for (int f = 0; f < frames; f++) {
        int16_t L = stereo_tmp[f * 2];
        int16_t R = stereo_tmp[f * 2 + 1];
        if (ch == 1) {
            /* Mono: average L+R. */
            int16_t m = (int16_t)(((int32_t)L + R) >> 1);
            if (bps == 3) {
                /* 24-bit LE: pad LSB with 0, then 16-bit value in upper 2 bytes. */
                p[0] = 0;
                p[1] = (uint8_t)(m & 0xFF);
                p[2] = (uint8_t)(m >> 8);
                p += 3;
            } else {
                p[0] = (uint8_t)(m & 0xFF);
                p[1] = (uint8_t)(m >> 8);
                p += 2;
            }
        } else {
            /* Channel 0 = L, 1 = R, 2+ = silence. */
            for (int c = 0; c < ch; c++) {
                int16_t s = (c == 0) ? L : (c == 1) ? R : 0;
                if (bps == 3) {
                    p[0] = 0;
                    p[1] = (uint8_t)(s & 0xFF);
                    p[2] = (uint8_t)(s >> 8);
                    p += 3;
                } else {
                    p[0] = (uint8_t)(s & 0xFF);
                    p[1] = (uint8_t)(s >> 8);
                    p += 2;
                }
            }
        }
    }
    return (int)(p - buf);
}

/* Fill all packets of an isochronous transfer from the ring.
 * Uses the per-packet fractional sample counter to track 44.1 kHz drift.
 * Clamps each packet to the endpoint MPS to avoid truncation by the USB
 * host controller (e.g. 6-channel 48 kHz: 49 frames × 12 = 588 > MPS 576). */
static void fill_isoc_xfer(usb_audio_dev_t *dev, usb_transfer_t *xfer)
{
    uint8_t *buf = xfer->data_buffer;
    int total = 0;
    uint32_t max_frames_per_pkt = dev->ep_out_mps / (dev->channels * dev->bytes_per_sample);
    for (int pkt = 0; pkt < ISOC_PKTS_PER_XFER; pkt++) {
        /* Compute frames for this 1-ms packet. */
        uint32_t frames = dev->base_samp_per_ms;
        dev->frac_acc += dev->frac_inc;
        if (dev->frac_acc >= 1000) {
            dev->frac_acc -= 1000;
            frames++;
        }
        /* Clamp to endpoint MPS — without this, the extra fractional frame
         * pushes the packet past MPS on multi-channel devices. */
        if (frames > max_frames_per_pkt)
            frames = max_frames_per_pkt;
        int bytes = pack_frames(dev, buf + total, (int)frames);
        xfer->isoc_packet_desc[pkt].num_bytes = bytes;
        total += bytes;
    }
    xfer->num_bytes = total;
}

/* ---------------------------------------------------------------------- */
/* Transfer callbacks                                                      */
/* ---------------------------------------------------------------------- */
static void isoc_out_cb(usb_transfer_t *xfer)
{
    usb_audio_dev_t *dev = (usb_audio_dev_t *)xfer->context;
    dev->xfer_pending--;

