probonopd/Synth_Dexed/esp32/main/esp32_usb_audio.cpp
    if (xfer->status == USB_TRANSFER_STATUS_NO_DEVICE) {
        /* Device gone — don't resubmit. */
        return;
    }

    if (xfer->status != USB_TRANSFER_STATUS_COMPLETED) {
        s_isoc_err_count_total++;
        if (s_isoc_err_count_total <= 10 || (s_isoc_err_count_total % 200) == 0) {
            ESP_LOGW(TAG, "Isoc OUT status=%d (count=%lu)", xfer->status,
                     (unsigned long)s_isoc_err_count_total);
        }
    } else {
        s_isoc_ok_count++;
    }

    if (dev->state != AUDIO_STREAMING) return;

    /* Refill and immediately resubmit for continuous playback.
     * For isochronous OUT this is safe to do directly in the callback.
     * Each transfer covers 6 ms so we're not in a tight spin. */
    fill_isoc_xfer(dev, xfer);
    esp_err_t err = usb_host_transfer_submit(xfer);
    if (err == ESP_OK) {
        dev->xfer_pending++;
    } else {
        s_resubmit_fails++;
        ESP_LOGW(TAG, "Isoc OUT resubmit failed: %s (count=%lu)",
                 esp_err_to_name(err), (unsigned long)s_resubmit_fails);
    }
}

static void ctrl_xfer_cb(usb_transfer_t *xfer)
{
    s_set_intf_ok   = (xfer->status == USB_TRANSFER_STATUS_COMPLETED);
    s_set_intf_done = true;
}

/* ---------------------------------------------------------------------- */
/* Client event callback                                                    */
/* ---------------------------------------------------------------------- */
static void audio_client_event_cb(const usb_host_client_event_msg_t *msg, void *arg)
{
    switch (msg->event) {
    case USB_HOST_CLIENT_EVENT_NEW_DEV:
        if (s_dev.state == AUDIO_IDLE) {
            s_new_addr  = msg->new_dev.address;
            s_actions  |= ACTION_OPEN;
        }
        break;
    case USB_HOST_CLIENT_EVENT_DEV_GONE:
        /* Only close if the audio device we opened is the one that left.
         * DEV_GONE fires for ALL device removals (any client), so we must
         * ignore removals of other devices (e.g. the USB MIDI keyboard). */
        if (s_dev.dev_hdl != NULL &&
                msg->dev_gone.dev_hdl == s_dev.dev_hdl) {
            ESP_LOGI(TAG, "USB audio device gone");
            s_actions |= ACTION_CLOSE;
        }
        break;
    default:
        break;
    }
}

/* ---------------------------------------------------------------------- */
/* Descriptor walking                                                      */
/* ---------------------------------------------------------------------- */
typedef struct {
    uint8_t  stream_intf;
    uint8_t  stream_alt;
    uint8_t  ep_addr;
    uint16_t ep_mps;
    uint8_t  channels;
    uint8_t  bytes_per_sample;  /* 2 = 16-bit, 3 = 24-bit */
    uint32_t sample_rate;
    bool     found;
} audio_stream_info_t;

static bool find_audio_stream(usb_device_handle_t dev_hdl,
                               uint8_t *ctrl_intf_out,
                               audio_stream_info_t *info)
{
    const usb_config_desc_t *desc = NULL;
    if (usb_host_get_active_config_descriptor(dev_hdl, &desc) != ESP_OK || !desc)
        return false;

    uint16_t total = desc->wTotalLength;
    int ofs = 0;
    const usb_standard_desc_t *cur = (const usb_standard_desc_t *)desc;

    ESP_LOGI(TAG, "Config descriptor: wTotalLength=%d bNumInterfaces=%d",
             total, desc->bNumInterfaces);

    bool in_stream = false;
    uint8_t cur_audio_intf = 0;
    uint8_t cur_alt = 0;
    bool ctrl_found = false;
    /* Track format acceptance for the current alt setting */
    bool cur_alt_has_ep   = false;
    uint8_t  cur_alt_ep   = 0;
    uint16_t cur_alt_mps  = 0;
    bool cur_alt_fmt_ok   = false;
    uint8_t  cur_alt_ch   = 0;
    uint8_t  cur_alt_bps  = 0;  /* bytes per sample (2 or 3) */
    uint32_t cur_alt_rate = 0;

    while (cur) {
        uint8_t dtype = cur->bDescriptorType;
        uint8_t dlen  = cur->bLength;
        const uint8_t *d = (const uint8_t *)cur;

        if (dtype == USB_B_DESCRIPTOR_TYPE_INTERFACE) {
            /* Commit previous alt if it was a valid stream. */
            if (in_stream && cur_alt > 0 && cur_alt_has_ep && cur_alt_fmt_ok) {
                /* Check sample rate compatibility. */
                uint32_t src = (uint32_t)FMRACK_SAMPLE_RATE;
                bool rate_ok = (cur_alt_rate == src) ||
                               (src == 44100 && cur_alt_rate == 48000) ||
                               (src == 48000 && cur_alt_rate == 44100);
                ESP_LOGI(TAG, "  alt %d: ch=%d %dbit rate=%lu ep=0x%02X MPS=%d rate_ok=%d",
                         cur_alt, cur_alt_ch, cur_alt_bps * 8,
                         (unsigned long)cur_alt_rate,
                         cur_alt_ep, cur_alt_mps, (int)rate_ok);
                if (rate_ok && cur_alt_ch >= 1 && cur_alt_ch <= 7 && !info->found) {
                    info->stream_intf     = cur_audio_intf;
                    info->stream_alt      = cur_alt;
                    info->ep_addr         = cur_alt_ep;
                    info->ep_mps          = cur_alt_mps;
                    info->channels        = cur_alt_ch;
                    info->bytes_per_sample = cur_alt_bps;
                    info->sample_rate     = cur_alt_rate;
                    info->found           = true;
                    ESP_LOGI(TAG, "AudioStreaming intf=%d alt=%d ep=0x%02X ch=%d %dbit rate=%lu",
                             cur_audio_intf, cur_alt, cur_alt_ep,
                             cur_alt_ch, cur_alt_bps * 8, (unsigned long)cur_alt_rate);
                }
            }

            /* Parse this interface descriptor. */
            if (dlen >= 9) {
                uint8_t inum   = d[2];
                uint8_t ialt   = d[3];
                uint8_t iclass = d[5];
                uint8_t isub   = d[6];

                ESP_LOGI(TAG, "  intf %d alt %d class=0x%02X sub=0x%02X proto=0x%02X",
                         inum, ialt, iclass, isub, d[7]);

                in_stream = false;

                if (iclass == USB_CLASS_AUDIO) {
                    cur_audio_intf = inum;
                    cur_alt = ialt;
                    if (isub == USB_SUBCLASS_AUDIOCONTROL && ialt == 0) {
                        ctrl_found = true;
                        *ctrl_intf_out = inum;
                    } else if (isub == USB_SUBCLASS_AUDIOSTREAMING) {
                        in_stream = true;
                        if (ialt > 0) {
                            /* Reset per-alt-setting state. */
                            cur_alt_has_ep  = false;
                            cur_alt_ep      = 0;
                            cur_alt_mps     = 0;
                            cur_alt_fmt_ok  = false;
                            cur_alt_ch      = 0;
                            cur_alt_bps     = 0;
                            cur_alt_rate    = 0;
                        }
                    }
                }
            }
        } else if (in_stream && dtype == USB_B_DESCRIPTOR_TYPE_ENDPOINT && dlen >= 7) {
            /* Endpoint descriptor within an AudioStreaming alt setting. */
            uint8_t  ep_addr  = d[2];
            uint8_t  ep_type  = d[3] & 0x03; /* bmAttributes[1:0] */
            uint16_t ep_mps   = (uint16_t)(d[4] | (d[5] << 8)) & 0x07FF;
            bool     is_out   = !(ep_addr & 0x80);
            ESP_LOGI(TAG, "  EP 0x%02X type=%d MPS=%d %s",
                     ep_addr, ep_type, ep_mps, is_out ? "OUT" : "IN");
            if (ep_type == 0x01 /* isochronous */ && is_out) {
                cur_alt_has_ep = true;
                cur_alt_ep     = ep_addr;
                cur_alt_mps    = ep_mps;
            }
        } else if (in_stream && cur_alt > 0 &&
                   dtype == 0x24 /* CS_INTERFACE */ && dlen >= 8) {
            /* Class-specific AudioStreaming descriptor. */
            uint8_t sub = d[2];
            if (sub == UAC_SUBTYPE_FORMAT_TYPE && d[3] == FORMAT_TYPE_I) {
                /* TYPE_I FORMAT descriptor:
                 *  d[4] = bNrChannels
                 *  d[5] = bSubFrameSize (bytes / subframe)
                 *  d[6] = bBitResolution
                 *  d[7] = bSamFreqType (0=continuous, N=discrete)
                 *  d[8..]: sample frequencies (3 bytes each) */
                uint8_t nr_ch     = d[4];
                uint8_t sub_frame = d[5];
                uint8_t bit_res   = d[6];
                uint8_t freq_type = (dlen > 7) ? d[7] : 0;
                /* Accept 16-bit (2 bytes/sample) and 24-bit (3 bytes/sample). */
                bool fmt_ok = ((sub_frame == 2 && bit_res == 16) ||
                               (sub_frame == 3 && bit_res == 24)) &&
                              nr_ch >= 1 && nr_ch <= 7;
                if (!fmt_ok) {
                    ESP_LOGI(TAG, "  Skipping FORMAT_TYPE_I: ch=%d sub_frame=%d bit_res=%d",
                             nr_ch, sub_frame, bit_res);
                }
                if (fmt_ok) {
                    cur_alt_ch  = nr_ch;
                    cur_alt_bps = sub_frame;
                    /* Extract first sample frequency. */
                    if (freq_type == 0 && dlen >= 14) {
                        /* Continuous range — use lower bound. */
                        cur_alt_rate = (uint32_t)d[8] | ((uint32_t)d[9] << 8) | ((uint32_t)d[10] << 16);
                    } else if (freq_type >= 1 && dlen >= 8 + 3) {
                        for (int fi = 0; fi < freq_type && (8 + fi*3 + 2) < dlen; fi++) {
                            uint32_t r = (uint32_t)d[8+fi*3]
                                       | ((uint32_t)d[9+fi*3] << 8)
                                       | ((uint32_t)d[10+fi*3] << 16);
                            /* Prefer exact match; otherwise accept 44100↔48000 pair. */
                            uint32_t want = (uint32_t)FMRACK_SAMPLE_RATE;
                            if (r == want) { cur_alt_rate = r; break; }
                            if ((r == 44100 && want == 48000) ||
                                (r == 48000 && want == 44100)) cur_alt_rate = r;
                            if (fi == 0 && cur_alt_rate == 0) cur_alt_rate = r;
                        }
                    }
                    if (cur_alt_rate > 0) cur_alt_fmt_ok = true;
                }
            }
        }

        cur = usb_parse_next_descriptor(cur, total, &ofs);
    }

