probonopd/Synth_Dexed/esp32/main/esp32_usb_audio.cpp
    /* Commit the last alt setting if it wasn't committed by a following interface. */
    if (in_stream && cur_alt > 0 && cur_alt_has_ep && cur_alt_fmt_ok) {
        uint32_t src = (uint32_t)FMRACK_SAMPLE_RATE;
        bool rate_ok = (cur_alt_rate == src) ||
                       (src == 44100 && cur_alt_rate == 48000) ||
                       (src == 48000 && cur_alt_rate == 44100);
        ESP_LOGI(TAG, "  alt %d (tail): ch=%d %dbit rate=%lu ep=0x%02X MPS=%d rate_ok=%d",
                 cur_alt, cur_alt_ch, cur_alt_bps * 8, (unsigned long)cur_alt_rate,
                 cur_alt_ep, cur_alt_mps, (int)rate_ok);
        if (rate_ok && cur_alt_ch >= 1 && cur_alt_ch <= 7 && !info->found) {
            info->stream_intf     = cur_audio_intf;
            info->stream_alt      = cur_alt;
            info->ep_addr         = cur_alt_ep;
            info->ep_mps          = cur_alt_mps;
            info->channels        = cur_alt_ch;
            info->bytes_per_sample = cur_alt_bps;
            info->sample_rate     = cur_alt_rate;
            info->found           = true;
        }
    }

    return ctrl_found && info->found;
}

/* ---------------------------------------------------------------------- */
/* Device open / close                                                     */
/* ---------------------------------------------------------------------- */
static void close_audio_device(void)
{
    if (!s_dev.dev_hdl) return;

    /* Stop any new resubmissions from the isoc callback first. */
    s_dev.state = AUDIO_IDLE;

    /* Releasing the streaming interface cancels all pending isochronous
     * transfers and drives the callbacks with CANCELED status before
     * returning.  Only after that is it safe to free the transfer objects. */
    if (s_dev.stream_intf_claimed) {
        usb_host_interface_release(s_client, s_dev.dev_hdl, s_dev.stream_intf);
        s_dev.stream_intf_claimed = false;
    }
    if (s_dev.ctrl_intf_claimed) {
        usb_host_interface_release(s_client, s_dev.dev_hdl, s_dev.ctrl_intf);
        s_dev.ctrl_intf_claimed = false;
    }

    /* Now safe to free transfer objects (all pending transfers have completed
     * or been cancelled by usb_host_interface_release above). */
    for (int i = 0; i < ISOC_XFER_COUNT; i++) {
        if (s_dev.isoc_xfers[i]) {
            usb_host_transfer_free(s_dev.isoc_xfers[i]);
            s_dev.isoc_xfers[i] = NULL;
        }
    }
    if (s_dev.ctrl_xfer) {
        usb_host_transfer_free(s_dev.ctrl_xfer);
        s_dev.ctrl_xfer = NULL;
    }

    usb_host_device_close(s_client, s_dev.dev_hdl);
    memset(&s_dev, 0, sizeof(s_dev));
    ESP_LOGI(TAG, "USB audio device closed");
}

static void open_audio_device(uint8_t addr)
{
    usb_device_handle_t hdl = NULL;
    if (usb_host_device_open(s_client, addr, &hdl) != ESP_OK) return;

    uint8_t ctrl_intf = 0;
    audio_stream_info_t info = {};
    if (!find_audio_stream(hdl, &ctrl_intf, &info)) {
        ESP_LOGI(TAG, "Device %d: no compatible AudioStreaming interface found", addr);
        usb_host_device_close(s_client, hdl);
        return;
    }

    s_dev.dev_hdl      = hdl;
    s_dev.ctrl_intf    = ctrl_intf;
    s_dev.stream_intf  = info.stream_intf;
    s_dev.stream_alt   = info.stream_alt;
    s_dev.ep_out       = info.ep_addr;
    s_dev.ep_out_mps   = info.ep_mps;
    s_dev.channels     = info.channels;
    s_dev.bytes_per_sample = info.bytes_per_sample;
    s_dev.dev_sample_rate = info.sample_rate;

    /* Fractional sample counter for 44.1 kHz etc. */
    s_dev.base_samp_per_ms = info.sample_rate / 1000;
    s_dev.frac_inc         = info.sample_rate % 1000;
    s_dev.frac_acc         = 0;

    src_init(&s_dev);

    ESP_LOGI(TAG, "USB audio: ch=%d %dbit rate=%lu Hz ep=0x%02X MPS=%d need_src=%d",
             s_dev.channels, s_dev.bytes_per_sample * 8,
             (unsigned long)s_dev.dev_sample_rate,
             s_dev.ep_out, s_dev.ep_out_mps, (int)s_dev.need_src);

    /* Verify MPS is large enough for the packet we'll send. */
    uint32_t max_frames = s_dev.base_samp_per_ms + 1; /* +1 for fractional rounding */
    uint32_t bytes_per_pkt = max_frames * s_dev.channels * s_dev.bytes_per_sample;
    ESP_LOGI(TAG, "USB audio: bytes/pkt=%lu (max_frames=%lu × ch=%d × %d), ep MPS=%d",
             (unsigned long)bytes_per_pkt, (unsigned long)max_frames,
             s_dev.channels, s_dev.bytes_per_sample, s_dev.ep_out_mps);
    if (bytes_per_pkt > s_dev.ep_out_mps) {
        ESP_LOGW(TAG, "WARNING: packet size %lu > endpoint MPS %d — will truncate!",
                 (unsigned long)bytes_per_pkt, s_dev.ep_out_mps);
    }

    /* Claim AudioControl interface. */
    if (usb_host_interface_claim(s_client, hdl, ctrl_intf, 0) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to claim AudioControl intf %d", ctrl_intf);
        usb_host_device_close(s_client, hdl);
        memset(&s_dev, 0, sizeof(s_dev));
        return;
    }
    s_dev.ctrl_intf_claimed = true;

    /* Claim AudioStreaming interface with the active alt setting so that
     * ESP-IDF USB host creates a pipe for the isochronous OUT endpoint.
     * Claiming alt=0 (zero-bandwidth) would leave no pipe for EP OUT, and
     * subsequent usb_host_transfer_submit() calls would silently never
     * complete. */
    if (usb_host_interface_claim(s_client, hdl, info.stream_intf, info.stream_alt) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to claim AudioStreaming intf %d alt %d",
                 info.stream_intf, info.stream_alt);
        usb_host_interface_release(s_client, hdl, ctrl_intf);
        usb_host_device_close(s_client, hdl);
        memset(&s_dev, 0, sizeof(s_dev));
        return;
    }
    s_dev.stream_intf_claimed = true;

    /* Send SET_INTERFACE to activate the streaming alternate setting. */
    if (usb_host_transfer_alloc(8, 0, &s_dev.ctrl_xfer) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to alloc control transfer");
        close_audio_device();
        return;
    }
    uint8_t *sp = s_dev.ctrl_xfer->data_buffer;
    sp[0] = SETUP_bmReqType_SET_INTF;
    sp[1] = SETUP_bRequest_SET_INTERFACE;
    sp[2] = (uint8_t)(info.stream_alt & 0xFF);
    sp[3] = 0;
    sp[4] = (uint8_t)(info.stream_intf & 0xFF);
    sp[5] = 0;
    sp[6] = 0; /* wLength = 0 */
    sp[7] = 0;
    s_dev.ctrl_xfer->device_handle    = hdl;
    s_dev.ctrl_xfer->bEndpointAddress = 0;  /* control endpoint */
    s_dev.ctrl_xfer->callback         = ctrl_xfer_cb;
    s_dev.ctrl_xfer->context          = &s_dev;
    s_dev.ctrl_xfer->num_bytes        = 8;

    s_set_intf_done = false;
    s_set_intf_ok   = false;
    s_dev.state = AUDIO_SET_INTF;

    /* Control transfers (EP0) must use usb_host_transfer_submit_control(),
     * not the generic usb_host_transfer_submit() which is for bulk/isoc/intr. */
    esp_err_t ce = usb_host_transfer_submit_control(s_client, s_dev.ctrl_xfer);
    if (ce != ESP_OK) {
        ESP_LOGE(TAG, "Failed to submit SET_INTERFACE: %s", esp_err_to_name(ce));
        close_audio_device();
    }
}

/* Allocate isochronous transfers and start streaming. */
static void start_streaming(void)
{
    for (int i = 0; i < ISOC_XFER_COUNT; i++) {
        /* Allocate transfer with data buffer in internal RAM (DMA-capable). */
        usb_transfer_t *xfer = NULL;
        if (usb_host_transfer_alloc(ISOC_XFER_BUF_BYTES, ISOC_PKTS_PER_XFER, &xfer) != ESP_OK) {
            ESP_LOGE(TAG, "Failed to alloc isoc transfer %d", i);
            close_audio_device();
            return;
        }

        /* usb_host_transfer_alloc already places the data buffer in
         * internal DMA-capable memory (MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA).
         * Do NOT replace data_buffer — the USB host library manages its
         * lifetime and alignment requirements internally. */

        xfer->device_handle    = s_dev.dev_hdl;
        xfer->bEndpointAddress = s_dev.ep_out;
        xfer->callback         = isoc_out_cb;
        xfer->context          = &s_dev;

        s_dev.isoc_xfers[i] = xfer;
    }

    s_dev.state       = AUDIO_STREAMING;
    s_dev.xfer_pending = 0;

