probonopd/Synth_Dexed/esp32/main/esp32_usb_audio.cpp
    /* Prime the ring buffer with silence so the first isochronous transfers
     * don't underrun before the audio write task starts feeding data.
     * Fill half the ring (~42 ms at 48 kHz) to give ample headroom for all
     * three initial transfer submissions plus early scheduling jitter. */
    {
        int16_t silence[64 * 2]; /* 64 stereo pairs × 4 bytes = 512 bytes on stack */
        memset(silence, 0, sizeof(silence));
        for (int i = 0; i < (RING_STEREO_PAIRS / 2) / 64; i++)
            ring_push(silence, 64);
    }

    /* Fill and submit all transfers. */
    for (int i = 0; i < ISOC_XFER_COUNT; i++) {
        fill_isoc_xfer(&s_dev, s_dev.isoc_xfers[i]);
        esp_err_t se = usb_host_transfer_submit(s_dev.isoc_xfers[i]);
        if (se == ESP_OK) {
            s_dev.xfer_pending++;
        } else {
            ESP_LOGE(TAG, "Initial isoc submit [%d] failed: %s", i, esp_err_to_name(se));
        }
    }

    ESP_LOGI(TAG, "USB audio streaming started (ch=%d rate=%lu Hz pkts/xfer=%d pending=%d)",
             s_dev.channels, (unsigned long)s_dev.dev_sample_rate,
             ISOC_PKTS_PER_XFER, s_dev.xfer_pending);
}

/* ---------------------------------------------------------------------- */
/* USB audio task                                                          */
/* ---------------------------------------------------------------------- */
static void usb_audio_task(void *arg)
{
    ESP_LOGI(TAG, "USB audio task started on core %d", xPortGetCoreID());

    usb_host_client_config_t cfg = {
        .is_synchronous = false,
        .max_num_event_msg = 5,
        .async = {
            .client_event_callback = audio_client_event_cb,
            .callback_arg          = NULL,
        },
    };
    if (usb_host_client_register(&cfg, &s_client) != ESP_OK) {
        ESP_LOGE(TAG, "USB audio client register failed");
        vTaskDelete(NULL);
        return;
    }

    /* Check for already-enumerated devices at startup.
     * esp32_usb_audio_init() is called after the 2-second USB settle delay in
     * main.cpp so any device already on the bus has been enumerated by here. */
    {
        uint8_t addrs[8];
        int n = 0;
        if (usb_host_device_addr_list_fill(sizeof(addrs), addrs, &n) == ESP_OK && n > 0) {
            ESP_LOGI(TAG, "Startup scan: %d device(s) already enumerated", n);
            for (int i = 0; i < n && s_dev.state == AUDIO_IDLE; i++)
                open_audio_device(addrs[i]);
        } else {
            ESP_LOGI(TAG, "Startup scan: no devices enumerated yet");
        }
    }

    while (s_running) {
        /* 1 ms timeout keeps us responsive to isochronous callbacks. */
        usb_host_client_handle_events(s_client, pdMS_TO_TICKS(1));

        /* Process connect action. */
        if ((s_actions & ACTION_OPEN) && s_dev.state == AUDIO_IDLE) {
            s_actions &= ~ACTION_OPEN;
            open_audio_device(s_new_addr);
        }

        /* Process SET_INTERFACE completion. */
        if (s_dev.state == AUDIO_SET_INTF && s_set_intf_done) {
            s_set_intf_done = false;
            if (s_set_intf_ok) {
                start_streaming();
            } else {
                ESP_LOGE(TAG, "SET_INTERFACE failed — no audio output");
                close_audio_device();
            }
        }

        /* Process disconnect action. */
        if (s_actions & ACTION_CLOSE) {
            s_actions &= ~ACTION_CLOSE;
            close_audio_device();
        }

        /* Periodic re-scan for late-enumerating devices.
         * USB hubs sometimes fail CHECK_SHORT_DEV_DESC on first attempt;
         * the ESP-IDF USB host retries internally but by the time it
         * succeeds, our startup scan and NEW_DEV event may both have
         * been missed.  Re-scan every ~3 s when idle. */
        static uint32_t s_rescan_count = 0;
        if (s_dev.state == AUDIO_IDLE && ++s_rescan_count >= 3000) {
            s_rescan_count = 0;
            uint8_t addrs[8];
            int n = 0;
            if (usb_host_device_addr_list_fill(sizeof(addrs), addrs, &n) == ESP_OK && n > 0) {
                for (int i = 0; i < n && s_dev.state == AUDIO_IDLE; i++)
                    open_audio_device(addrs[i]);
            }
        }
        /* Reset rescan counter when not idle (device connected). */
        if (s_dev.state != AUDIO_IDLE) s_rescan_count = 0;

        /* Heartbeat every ~2 s (2000 × 1 ms) — fast enough to catch issues. */
        static uint32_t s_loop_count = 0;
        if (++s_loop_count >= 2000) {
            s_loop_count = 0;
            int fill = ring_fill_level();
            ESP_LOGI(TAG, "USB-A: st=%d pend=%d ok=%lu err=%lu ring=%d/%d "
                     "underrun=%lu overflow=%lu resubfail=%lu",
                     (int)s_dev.state, s_dev.xfer_pending,
                     (unsigned long)s_isoc_ok_count,
                     (unsigned long)s_isoc_err_count_total,
                     fill, RING_STEREO_PAIRS - 1,
                     (unsigned long)s_ring_underruns,
                     (unsigned long)s_ring_overflows,
                     (unsigned long)s_resubmit_fails);
        }
    }

    close_audio_device();
    usb_host_client_deregister(s_client);
    s_client = NULL;
    ESP_LOGI(TAG, "USB audio task exiting");
    vTaskDelete(NULL);
}

/* ---------------------------------------------------------------------- */
/* Public API                                                              */
/* ---------------------------------------------------------------------- */

int esp32_usb_audio_init(void)
{
    if (s_running) return 0;
    s_running = true;

    BaseType_t ok = xTaskCreatePinnedToCore(
        usb_audio_task, "usb_audio",
        6 * 1024, NULL,
        /* Same priority as USB MIDI — isochronous transfers are equally
         * time-critical and must not be starved by the MIDI task. */
        USB_MIDI_TASK_PRIORITY,
        &s_task,
        USB_MIDI_TASK_CORE);

    if (ok != pdPASS) {
        ESP_LOGE(TAG, "Failed to create USB audio task");
        s_running = false;
        return -1;
    }
    ESP_LOGI(TAG, "USB audio driver initialised");
    return 0;
}

void esp32_usb_audio_stop(void)
{
    s_running = false;
    vTaskDelay(pdMS_TO_TICKS(200));
    s_task = NULL;
}

bool esp32_usb_audio_is_ready(void)
{
    return s_dev.state == AUDIO_STREAMING;
}

int esp32_usb_audio_get_channels(void)
{
    return (s_dev.state == AUDIO_STREAMING) ? (int)s_dev.channels : 0;
}

void esp32_usb_audio_write_stereo(const int16_t *buf, int num_stereo_pairs)
{
    if (s_dev.state != AUDIO_STREAMING) return;
    ring_push(buf, num_stereo_pairs);
}
